<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ownCloudDesktopClient and creates a package. Then, uploads to the JSS.</string>
    <key>Identifier</key>
    <string>com.github.charliwest.jss-recipes.jss.ownCloudDesktopClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ownCloudDesktopClient</string>
        <key>CATEGORY</key>
        <string>Utilities</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string>Policy.xml</string>
        <key>SELF_SERVICE_ICON</key>
        <string>ownCloudDesktopClient.png</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-update-smart</string>
        <key>GROUP_TEMPLATE</key>
        <string>SmartGroup.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>ownCloud is a self-hosted file sync and share server. It provides access to your data through a web interface (owncloud.ripe.net), sync clients or WebDAV while providing a platform to view, sync and share across devices easily.</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
    <string>com.github.gerardkok.pkg.ownCloudDesktopClient</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>self_service_icon</key>
                <string>%SELF_SERVICE_ICON%</string>
                <key>self_service_description</key>
                <string>%SELF_SERVICE_DESCRIPTION%</string>
		<key>scripts</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>addOwncloudDetails.sh</string>
                        <key>template_path</key>
                        <string>ownCloudDesktopClientTemplate.xml</string>
                    </dict>
                </array>
                <key>groups</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE%</string>
                    </dict>
                </array>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
