<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Oracle Java 9 JRE and copies out the flat installer pkg within, appending the version number to the filename. (Note the version of the actual pkg id for the com.oracle.jre pkg component is still always "1.0".) To use this
            recipe, you must accept the Oracle Binary Code License Agreement for Java SE. http://www.oracle.com/technetwork/java/javase/terms/license/index.html Then, uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.jss-recipes.jss.OracleJava9</string>
        <key>Input</key>
        <dict>
            <key>CATEGORY</key>
            <string>Digital Media</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>OracleJava9SmartGroupTemplate.xml</string>
            <key>NAME</key>
            <string>OracleJava9</string>
            <key>OS_REQUIREMENTS</key>
            <string>10.13.x,10.12.x,10.11.x,10.10.x,10.9.x,10.8.5,10.8.4,10.8.3,10.7.5,10.7.4,10.7.3</string>
            <key>PKG_ID</key>
            <string>com.oracle.jre</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>PolicyTemplate.xml</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>Browser plugin to allow execution of Java applets.</string>
            <key>SELF_SERVICE_ICON</key>
            <string>OracleJava9.png</string>
            <key>Comment</key>
            <string>Note: PlistReader without variable injection in AutoPkg requires setting "version" input key to an empty string, as below.</string>
            <key>version</key>
            <string></string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.OracleJava9</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>ext_attribute_path</key>
                            <string>OracleJava9ExtensionAttribute.xml</string>
                        </dict>
                    </array>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>os_requirements</key>
                    <string>%OS_REQUIREMENTS%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
