<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of BitTorrent Sync and makes a pkg of it then uploads it to the JSS.

Note: This recipe is deprecated, and should be replaced with com.github.jss-recipes.jss.ResilioSync.</string>
	<key>Identifier</key>
	<string>com.github.jss-recipes.jss.BitTorrentSync</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jss-recipes.jss.ResilioSync</string>
</dict>
</plist>
