<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>
This AutoPkg recipe was created using JSSRecipeCreator: 
https://github.com/sheagcraig/JSSRecipeCreator

It is meant to be used with JSSImporter: 
https://github.com/sheagcraig/JSSImporter

For tips on integrating JSSImporter into your Casper environment, check out Auto Update Magic:
https://github.com/homebysix/auto-update-magic</string>
        <key>Description</key>
        <string>Downloads the current Adobe Reader pkg and repackages, replacing a problematic preinstall script, 
and enabling installation on non-boot volumes. Setting MAJOR_VERSION to "10" will cause a download of the 
latest/last version of Adobe Reader 10, but the repackager is unlikely to operate properly with that version.
 Then, uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.sheagcraig.jss.AdobeReader</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdobeReader</string>
            <key>CATEGORY</key>
            <string>Productivity</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <!--PlistReader w/o variable injection in AutoPkg requires this-->
            <key>version</key>
            <string/>
            <key>POLICY_TEMPLATE</key>
            <string>PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>AdobeReader.png</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>SmartGroupTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string>Opens PDF files. (Alternative to built-in Preview app.)</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.googlecode.autopkg.pkg.AdobeReader</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
