<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>
This AutoPkg recipe was created using JSSRecipeCreator: 
https://github.com/sheagcraig/JSSRecipeCreator

It is meant to be used with JSSImporter: 
https://github.com/sheagcraig/JSSImporter

For tips on integrating JSSImporter into your Casper environment, check out Auto Update Magic:
https://github.com/homebysix/auto-update-magic</string>
    <key>Description</key>
    <string>Downloads the latest CitrixReceiver version and extracts the package. Then, uploads to the JSS.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.cgerke-recipes.jss.CitrixReceiver</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Utility</string>
        <key>DESCRIPTION</key>
        <string>Citrix Receiver is client software that provides access to your XenApp server.</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-update-smart</string>
        <key>GROUP_TEMPLATE</key>
        <string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
        <key>ICON</key>
        <string>%RECIPE_DIR%/CitrixReceiver.png</string>
        <key>NAME</key>
        <string>CitrixReceiver</string>
        <key>JSS_INVENTORY_NAME</key>
        <string>Citrix Receiver</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.cgerke-recipes.pkg.CitrixReceiver</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>groups</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE%</string>
                    </dict>
                </array>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>jss_inventory_name</key>
                <string>%JSS_INVENTORY_NAME%</string>
                <key>self_service_description</key>
                <string>%DESCRIPTION%</string>
                <key>self_service_icon</key>
                <string>%ICON%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
