<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest version of Evernote and makes a pkg of it then uploads it to the JSS.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.jss.Evernote</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Evernote</string>
        <key>CATEGORY</key>
        <string>Productivity</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Evernote</string>
    <key>Process</key>
    <array>
	<dict>
        <key>Arguments</key>
        <dict>
            <key>prod_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%CATEGORY%</string>
            <key>policy_category</key>
            <string>%POLICY_CATEGORY%</string>
			<key>policy_template</key>
			<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>groups</key>
			<array>
				<dict>
					<key>name</key>
					<string>%NAME%-update-smart</string>
					<key>smart</key>
					<true/>
					<key>template_path</key>
					<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
				</dict>
			</array>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
	</dict>
    </array>
</dict>
</plist>
