<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Firefox disk image and builds a package, then uploads to the JSS.
Values for FIREFOX_BUILD correspond to directories here: http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
Some useful values are: 'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
LOCALE corresponds to directories at http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'
No idea if all Firefox builds are available in all the same localizations, so you may need to verify that any particular
combination is offered.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.jss.Firefox_EN</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Firefox</string>
        <key>CATEGORY</key>
        <string>Web Browsers and Internet Utilities</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.Firefox_EN</string>
    <key>Process</key>
    <array>
	<dict>
        <key>Arguments</key>
        <dict>
            <key>prod_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%CATEGORY%</string>
            <key>policy_category</key>
            <string>%POLICY_CATEGORY%</string>
			<key>policy_template</key>
			<string>%POLICY_TEMPLATE%</string>
            <key>groups</key>
			<array>
				<dict>
					<key>name</key>
					<string>%GROUP_NAME%</string>
					<key>smart</key>
					<true/>
					<key>template_path</key>
					<string>%GROUP_TEMPLATE%</string>
				</dict>
			</array>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
	</dict>
    </array>
</dict>
</plist>
