<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest Geogebra disk image, builds a package, and uploads to the JSS.</string>
		<!--Geogebra 5 changes the package ID. The installer app ignores a
			 previously installed Geogebra 4 and makes a subfolder to install
			 into. This is not what is desired, thus, a preinstall script will
			 remove old versions.-->
        <key>Identifier</key>
        <string>com.github.sheagcraig.jss.Geogebra</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Geogebra</string>
            <key>CATEGORY</key>
            <string>Science and Math</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <!--PlistReader w/o variable injection in AutoPkg requires this-->
            <key>version</key>
            <string/>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Geogebra.png</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
			<key>SCRIPT_TEMPLATE</key>
			<string>%RECIPE_DIR%/GeogebraScriptTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string>Dynamic mathematics and science for learning and teaching.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.sheagcraig.pkg.Geogebra</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
					<key>scripts</key>
					<array>
						<dict>
							<key>name</key>
							<string>GeogebraPreinstall.sh</string>
							<key>template_path</key>
							<string>%SCRIPT_TEMPLATE%</string>
						</dict>
					</array>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
