<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uses parent pkg recipe to download latest GoogleChrome and import it into the JSS.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.jss.googlechrome</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Google</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>SELFSERVE_POLICY</key>
        <string>Latest_%NAME%</string>
        <key>ARB_GROUP_NAME</key>
        <string>Testing</string>
        <key>DOWNLOAD_URL</key>
        <string>http://dl.google.com/chrome/mac/stable/GGRO/googlechrome.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.googlechrome</string>
    <key>Process</key>
    <array>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>prod_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%CATEGORY%</string>
            <key>policy_category</key>
            <string>%POLICY_CATEGORY%</string>
            <key>selfserve_policy</key>
            <string>Install Latest %NAME%-%version%</string>
            <key>arb_group_name</key>
            <string>%ARB_GROUP_NAME%</string>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
