<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uses parent pkg recipe to download latest GoogleChrome and import it into the JSS.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.jss.googlechrome</string>
    <key>Input</key>
    <dict>
		<key>NAME</key>
		<string>GoogleChrome</string>
		<key>JSSINVENTORY_NAME</key>
		<string>Google Chrome.app</string>
        <key>CATEGORY</key>
        <string>Google</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>DOWNLOAD_URL</key>
        <string>http://dl.google.com/chrome/mac/stable/GGRO/googlechrome.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.googlechrome</string>
    <key>Process</key>
    <array>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>prod_name</key>
            <string>%NAME%</string>
			<key>jss_inventory_name</key>
			<string>%JSSINVENTORY_NAME%</string>
            <key>category</key>
            <string>%CATEGORY%</string>
            <key>policy_category</key>
            <string>%POLICY_CATEGORY%</string>
			<key>policy_template</key>
			<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>groups</key>
			<array>
				<dict>
					<key>name</key>
					<string>%NAME%-update-smart</string>
					<key>smart</key>
					<true/>
					<key>template_path</key>
					<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
				</dict>
			</array>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
