<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Handbrake disk image, creates a package and uploads it to the jss.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.jss.Handbrake</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HandBrake</string>
        <key>CATEGORY</key>
        <string>Media Plugins and Viewers</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/Handbrake.png</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
		<key>DESCRIPTION</key>
		<string>HandBrake is a tool for converting video from nearly any format to a selection of modern, widely supported codecs.</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.Handbrake</string>
    <key>Process</key>
    <array>
		<dict>
		<key>Arguments</key>
        <dict>
            <key>prod_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%CATEGORY%</string>
            <key>policy_category</key>
            <string>%POLICY_CATEGORY%</string>
			<key>policy_template</key>
			<string>%POLICY_TEMPLATE%</string>
			<key>self_service_icon</key>
			<string>%ICON%</string>
			<key>self_service_description</key>
			<string>%DESCRIPTION%</string>
            <key>groups</key>
			<array>
				<dict>
					<key>name</key>
					<string>%GROUP_NAME%</string>
					<key>smart</key>
					<true/>
					<key>template_path</key>
					<string>%GROUP_TEMPLATE%</string>
				</dict>
			</array>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
