<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Oracle Java 7 JRE and builds a new package with correct version information.

All Oracle JRE install packages have a version number of 1, so the actual plugin version is used to replace the installer version, taken from the CFBundleVersion of the bundle at /Library/Internet Plug-Ins/JavaAppletPlugin.plugin.</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.jss.OracleJava7</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OracleJava7</string>
        <key>PKG_ID</key>
        <string>com.oracle.jre</string>
        <key>CATEGORY</key>
        <string>Media Plugins and Viewers</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
		<!--PlistReader w/o variable injection in AutoPkg requires this-->
		<key>version</key>
		<string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.OracleJava7</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>OracleJavaUpdate-smart</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%RECIPE_DIR%/OracleJavaSmartGroupTemplate.xml</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
    </array>
</dict>
</plist>
