<policy>
    <general>
        <name>Install %PROD_NAME%-%VERSION%</name>
        <enabled>true</enabled>
        <frequency>Once per computer</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
	<scope>
		<!--Scope added by JSSImporter-->
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
		<!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
