<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version PyCharm, and makes a package of it. Then, uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.jss-recipes.jss.pycharm</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>PyCharm</string>
            <key>CATEGORY</key>
            <string>Computer Science</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>PolicyTemplate.xml</string>
            <key>SELF_SERVICE_ICON</key>
            <string>PyCharm.png</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>SmartGroupTemplate.xml</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>PyCharm is an Integrated Development Environment (IDE) used
for programming in Python. It provides code analysis, a
graphical debugger, an integrated unit tester, integration with
version control systems (VCSes), and supports web development
with Django.
            </string>
            <!--PlistReader w/o variable injection in AutoPkg requires this-->
            <key>version</key>
            <string/>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>ParentRecipe</key>
        <string>com.github.hansen-m.pkg.pycharm</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>jss_inventory_name</key>
                    <string>PyCharm CE.app</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
