<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ChefDK, makes a pkg of it, and uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.jss-recipes.jss.ChefDK</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Developer Tools</string>
		<key>GROUP_NAME</key>
		<string>ChefDK Version</string>
		<key>GROUP_TEMPLATE</key>
		<string>ChefDKSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>ChefDK</string>
		<key>POLICY_CATEGORY</key>
		<string>Developer Tools</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>The Chef Development Kit contains everything you need to start using Chef, along with the tools essential to managing the code that runs your business.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>ChefDK.png</string>
		<key>version</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.kitzy.pkg.ChefDK</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>ChefDKExtensionAttribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
