<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Word 2016 multilingual update pkg,
			and appends the version to the end of the filename.

			LOCALE_ID sets the locale for a descriptive text that will be
			extracted from the Microsoft update metadata. See
			https://msdn.microsoft.com/en-us/goglobal/bb964664.aspx
			for more information about locale IDs.

			VERSION currently only supports 'latest'.
			Then, uploads to the JSS.</string>
			<key>Identifier</key>
			<string>com.github.jss-recipes.jss.MicrosoftWord</string>
			<key>Input</key>
			<dict>
				<key>CATEGORY</key>
				<string>Productivity</string>
				<key>SELF_SERVICE_DESCRIPTION</key>
				<string>Microsoft Word is a graphical word processing program that users can type with. It is made by the computer company Microsoft. The purpose of the MS Word is to allow the users to type and save documents.</string>
				<key>GROUP_NAME</key>
				<string>%NAME%-update-smart</string>
				<key>GROUP_TEMPLATE</key>
				<string>Microsoft WordSmartGroupTemplate.xml</string>
				<key>SELF_SERVICE_ICON</key>
				<string>Microsoft Word.png</string>
				<key>NAME</key>
				<string>Microsoft Word</string>
				<key>POLICY_CATEGORY</key>
				<string>Testing</string>
				<key>POLICY_TEMPLATE</key>
				<string>PolicyTemplate.xml</string>
			</dict>
			<key>MinimumVersion</key>
			<string>0.4.2</string>
			<key>ParentRecipe</key>
			<string>com.github.autopkg.download.MSWord2016</string>
			<key>Process</key>
			<array>
				<dict>
					<key>Arguments</key>
					<dict>
						<key>category</key>
						<string>%CATEGORY%</string>
						<key>groups</key>
						<array>
							<dict>
								<key>name</key>
								<string>%GROUP_NAME%</string>
								<key>smart</key>
								<true/>
								<key>template_path</key>
								<string>%GROUP_TEMPLATE%</string>
							</dict>
						</array>
						<key>policy_category</key>
						<string>%POLICY_CATEGORY%</string>
						<key>policy_template</key>
						<string>%POLICY_TEMPLATE%</string>
						<key>pkg_path</key>
						<string>%pathname%</string>
						<key>prod_name</key>
						<string>%NAME%</string>
						<key>self_service_description</key>
						<string>%SELF_SERVICE_DESCRIPTION%</string>
						<key>self_service_icon</key>
						<string>%SELF_SERVICE_ICON%</string>
					</dict>
					<key>Processor</key>
					<string>JSSImporter</string>
				</dict>
			</array>
		</dict>
	</plist>
