<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Shockwave Player installer and extracts the embedded package, uploads to JSS.</string>
	<key>Identifier</key>
	<string>com.github.jss-recipes.jss.AdobeShockwavePlayer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Shockwave Player</string>
		<key>CATEGORY</key>
		<string>Digital Media</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>Adobe Shockwave PlayerSmartGroupTemplate.xml</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Adobe Shockwave Player.png</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Over 450 million Internet-enabled desktops have Adobe Shockwave Player installed. These users have access to some of the best content the Web has to offer - including dazzling 3D games and entertainment, interactive product demonstrations, and online learning applications. Shockwave Player displays Web content that has been created using Adobe Director.</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.pkg.AdobeShockwavePlayer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>Adobe Shockwave PlayerExtensionAttribute.xml</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
