<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Firefox disk image and builds a package, then uploads to
the JSS, including autoconfig resources (typically as generated via the CCK2 tool).

Place the autoconfig.zip  in the same directory as the recipe. You may
optionally use a different name by setting AUTOCONFIG_FILENAME.
Firefox 35 and later require an AUTOCONFIG_DIR of "Contents/Resources";
pre-34 requires "Content/MacOS". Firefox 34 is not supported by this recipe.
ORG_NAME is inserted into the pkg name to distinguish a vanilla
"Firefox-35.0.pkg" from "Firefox_PretendCo-35.0.pkg". You might consider setting
a unique PKG_ID to differentiate your org's "flavor" of Firefox.

Values for RELEASE correspond to directories here:
    http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
Some useful values are:
    'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
LOCALE corresponds to directories at
    http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'

No idea if all Firefox builds are available in all the same localizations,
so you may need to verify that any particular combination is offered. Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.jss-recipes.jss.FirefoxAutoconfig</string>
	<key>Input</key>
	<dict>
		<key>AUTOCONFIG_DIR</key>
		<string>Contents/Resources/</string>
		<key>AUTOCONFIG_FILENAME</key>
		<string>autoconfig.zip</string>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>LOCALE</key>
		<string>en_US</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>ORG_NAME</key>
		<string>Customized</string>
		<key>PKG_ID</key>
		<string>org.mozilla.firefox.pkg</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>RELEASE</key>
		<string>latest</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Web Browser.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Firefox.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gregneagle.pkg.FirefoxAutoconfig</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
