<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Geogebra disk image, builds a package, and uploads to the JSS.

Note: Geogebra 5 changes the package ID. The installer app ignores a previously installed Geogebra 4 and makes a subfolder to install into. This is not what is desired, thus, a preinstall script will remove old versions.</string>
    <key>Identifier</key>
    <string>com.github.jss-recipes.jss.Geogebra</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Science and Math</string>
        <key>Comment</key>
        <string>Note: PlistReader without variable injection in AutoPkg requires setting "version" input key to an empty string, as below.</string>
        <key>GROUP_NAME</key>
        <string>%NAME%-update-smart</string>
        <key>GROUP_TEMPLATE</key>
        <string>SmartGroupTemplate.xml</string>
        <key>NAME</key>
        <string>Geogebra</string>
        <key>POLICY_CATEGORY</key>
        <string>Testing</string>
        <key>POLICY_TEMPLATE</key>
        <string>PolicyTemplate.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>Dynamic mathematics and science for learning and teaching.</string>
        <key>SELF_SERVICE_ICON</key>
        <string>Geogebra.png</string>
        <key>version</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.sheagcraig.pkg.Geogebra</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>groups</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE%</string>
                    </dict>
                </array>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>scripts</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>GeogebraPreinstall.sh</string>
                        <key>template_path</key>
                        <string>GeogebraScriptTemplate.xml</string>
                    </dict>
                </array>
                <key>self_service_description</key>
                <string>%SELF_SERVICE_DESCRIPTION%</string>
                <key>self_service_icon</key>
                <string>%SELF_SERVICE_ICON%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
