<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the current release version of Intellij IDEA Ultimate and imports into a JAMF Pro Server.</string>
  <key>Identifier</key>
  <string>com.github.jss-recipes.jss.IntelliJIDEAIU</string>
  <key>Input</key>
  <dict>
    <key>CATEGORY</key>
    <string>Computer Science</string>
    <key>GROUP_NAME</key>
    <string>%NAME%-update-smart</string>
    <key>GROUP_TEMPLATE</key>
    <string>SmartGroupTemplate.xml</string>
    <key>NAME</key>
    <string>IntelliJ IDEA IU</string>
    <key>POLICY_CATEGORY</key>
    <string>Testing</string>
    <key>POLICY_TEMPLATE</key>
    <string>PolicyTemplate.xml</string>
    <key>SELF_SERVICE_DESCRIPTION</key>
    <string>A capable and ergonomic Java IDE by JetBrains. Every aspect of IntelliJ IDEA has been designed to maximize developer productivity. Together, intelligent coding assistance and ergonomic design make development not only productive but also enjoyable.</string>
    <key>SELF_SERVICE_ICON</key>
    <string>IntelliJ IDEA IU.png</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.4.0</string>
  <key>ParentRecipe</key>
  <string>com.github.mosen.download.IDEA-IU</string>
  <key>ParentRecipe</key>
  <string>com.github.skoobasteeve.pkg.IntelliJIDEAIU</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>category</key>
        <string>%CATEGORY%</string>
        <key>groups</key>
        <array>
          <dict>
            <key>name</key>
            <string>%GROUP_NAME%</string>
            <key>smart</key>
            <true/>
            <key>template_path</key>
            <string>%GROUP_TEMPLATE%</string>
          </dict>
        </array>
        <key>policy_category</key>
        <string>%POLICY_CATEGORY%</string>
        <key>policy_template</key>
        <string>%POLICY_TEMPLATE%</string>
        <key>prod_name</key>
        <string>%NAME%</string>
        <key>self_service_description</key>
        <string>%SELF_SERVICE_DESCRIPTION%</string>
        <key>self_service_icon</key>
        <string>%SELF_SERVICE_ICON%</string>
      </dict>
      <key>Processor</key>
      <string>JSSImporter</string>
    </dict>
  </array>
</dict>
</plist>
