<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the current release version of 1Password and builds a package. Then, uploads to the JSS.</string>
  <key>Identifier</key>
  <string>com.github.jss-recipes.jss.1Password</string>
  <key>Input</key>
  <dict>
    <key>CATEGORY</key>
    <string>Utility</string>
    <key>SELF_SERVICE_DESCRIPTION</key>
    <string>1Password for Mac lets you keep all of your log-ins in one place, so you'll never have to worry about forgetting passwords again. And all of the information you enter into this app is protected by a master password, which means you won't have to worry about unauthorized access, either.</string>
    <key>GROUP_NAME</key>
    <string>%NAME%-update-smart</string>
    <key>GROUP_TEMPLATE</key>
    <string>SmartGroupTemplate.xml</string>
    <key>SELF_SERVICE_ICON</key>
    <string>1Password.png</string>
    <key>NAME</key>
    <string>1Password</string>
    <key>POLICY_CATEGORY</key>
    <string>Testing</string>
    <key>POLICY_TEMPLATE</key>
    <string>PolicyTemplate.xml</string>
    <key>MAJOR_VERSION</key>
    <string>5</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>ParentRecipe</key>
  <string>io.github.hjuutilainen.pkg.1Password</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>category</key>
        <string>%CATEGORY%</string>
        <key>groups</key>
        <array>
          <dict>
            <key>name</key>
            <string>%GROUP_NAME%</string>
            <key>smart</key>
            <true/>
            <key>template_path</key>
            <string>%GROUP_TEMPLATE%</string>
          </dict>
        </array>
        <key>policy_category</key>
        <string>%POLICY_CATEGORY%</string>
        <key>policy_template</key>
        <string>%POLICY_TEMPLATE%</string>
        <key>prod_name</key>
        <string>%NAME%</string>
        <key>self_service_description</key>
        <string>%SELF_SERVICE_DESCRIPTION%</string>
        <key>self_service_icon</key>
        <string>%SELF_SERVICE_ICON%</string>
      </dict>
      <key>Processor</key>
      <string>JSSImporter</string>
    </dict>
  </array>
</dict>
</plist>
